Revit 2027 API
BarTerminationsData.CrankTypeIdAtEnd Property
 Identifies the crank type at the end of bar. Setting this property to a valid value, will set the HookTypeIdAtEnd and EndTreatmentTypeIdAtEnd to ElementId.InvalidElementId.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CrankTypeIdAtEnd { get; set; }
Public Property CrankTypeIdAtEnd As ElementId
	Get
	Set
public:
property ElementId^ CrankTypeIdAtEnd {
	ElementId^ get ();
	void set (ElementId^ value);
}
member CrankTypeIdAtEnd : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: crankTypeIdAtEnd doesn't represent a crank type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BarTerminationsData Class
Autodesk.Revit.DB.Structure Namespace